### Nested Select

In [2]:
# Ignore
%load_ext sql
%sql sqlite://
%config SqlMagic.feedback = False

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Create Data

In [3]:
%%sql

-- Create a table of criminals
CREATE TABLE criminals (pid, name, age, sex, city, minor);
INSERT INTO criminals VALUES (412, 'James Smith', 15, 'M', 'Santa Rosa', 1);
INSERT INTO criminals VALUES (234, 'Bill James', 22, 'M', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (632, 'Stacy Miller', 23, 'F', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (621, 'Betty Bob', NULL, 'F', 'Petaluma', 1);
INSERT INTO criminals VALUES (162, 'Jaden Ado', 49, 'M', NULL, 0);
INSERT INTO criminals VALUES (901, 'Gordon Ado', 32, 'F', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (512, 'Bill Byson', 21, 'M', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (411, 'Bob Iton', NULL, 'M', 'San Francisco', 0);

[]

### Select Based On The Result Of A Select

In [5]:
%%sql

-- Select name and age from table 'criminals' where age is greater than, select age from criminals where the name is 'James Smith'

SELECT name, age
FROM criminals
WHERE age > (SELECT age FROM criminals WHERE name == 'James Smith')

[('Bill James', 22),
 ('Stacy Miller', 23),
 ('Jaden Ado', 49),
 ('Gordon Ado', 32),
 ('Bill Byson', 21)]

Source: https://chrisalbon.com/sql/nested_select.html